-- 2024 02 26

-- Данные можно читать, добавлять, редактировать, удалять

-- Язык SQL

-- Команды DML (Data Manipulation Language) -- например, добавление новой строчки
-- SELECT - Выборка (получение) данных
-- INSERT - Вставка данных
-- UPDATE - Редактирование (изменение) данных
-- DELETE - Удаление (строчек) данных

-- Команды DDL (Data Definition Language) -- например, создание нового столбца БД
-- CREATE - Создание объекта базы данных (например, таблицы) или самой базы данных
-- ALTER - Редактирование объекта
-- DROP - Удаление объекта

-- Команды TCL (Transaction Control Language)

-- Команды DCL (Data Control Language)
